{
  "architectures": [
    "MobileViTForImageClassification"
  ],
  "aspp_dropout_prob": 0.1,
  "aspp_out_channels": 256,
  "atrous_rates": [
    6,
    12,
    18
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "conv_kernel_size": 3,
  "expand_ratio": 4.0,
  "hidden_act": "silu",
  "hidden_dropout_prob": 0.1,
  "hidden_sizes": [
    144,
    192,
    240
  ],
  "id2label": {
    "0": "calling",
    "1": "clapping",
    "2": "cycling",
    "3": "dancing",
    "4": "drinking",
    "5": "eating",
    "6": "fighting",
    "7": "hugging",
    "8": "laughing",
    "9": "listening_to_music",
    "10": "running",
    "11": "sitting",
    "12": "sleeping",
    "13": "texting",
    "14": "using_laptop"
  },
  "image_size": 256,
  "initializer_range": 0.02,
  "label2id": {
    "calling": 0,
    "clapping": 1,
    "cycling": 2,
    "dancing": 3,
    "drinking": 4,
    "eating": 5,
    "fighting": 6,
    "hugging": 7,
    "laughing": 8,
    "listening_to_music": 9,
    "running": 10,
    "sitting": 11,
    "sleeping": 12,
    "texting": 13,
    "using_laptop": 14
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 2.0,
  "model_type": "mobilevit",
  "neck_hidden_sizes": [
    16,
    32,
    64,
    96,
    128,
    160,
    640
  ],
  "num_attention_heads": 4,
  "num_channels": 3,
  "output_stride": 32,
  "patch_size": 2,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "semantic_loss_ignore_index": 255,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3"
}
